//************* LCD4.C *********************
//*動作：在文字型LCD上顯示"2007年07月15日
//*******************************************
#include "..\AT89X52.H"   //暫存器及組態定義
sfr  Data=0x80;//P0資料BUS輸出
sbit RS=0x96;  //P16 LCD指令/資料控制,RS=0指令，RS=1資料
                 //LCD讀取/寫入控制,R/W=GND寫入
sbit EN=0x97;  //P17 LCD致能輸出,EN=0禁能LCD，EN=1致能LCD

char code mes[]="2007\00007\00115\002";//2007年07月15日
char code Table[]={
 0x10,0x1f,0x02,0x0f,0x0a,0xff,0x02,0x00, //年
 0x0f,0x09,0x0f,0x09,0x0f,0x09,0x13,0x00, //月
 0x0f,0x09,0x09,0x0f,0x09,0x09,0x0f,0x00};//日
main()
{
  char i;		 //陣列資料計數
  LCD_init();   //重置及清除LCD
  for(i=0x0;i<=23;i++) //寫入年月日字型 
   {
     LCD_Cmd(0x40+i);    //指定CGRAM位址  
     LCD_Data(Table[i]); //寫入CGRAM資料  
   } 
  LCD_Cmd(0x80);		 //指定第一行顯示		
  for(i=0;i<11;i++) LCD_Data(mes[i]);//顯示年月日
  while(1);	 //停止
}
/***********************************************************
*函數名稱: LCD_Data
*功能描述: 傳送資料到文字型LCD
*輸入參數：dat
************************************************************/
void LCD_Data(char dat)  //傳送資料到LCD
{
    Data=dat; //資料送到BUS
    RS=1;EN=1;//資料寫入到LCD內
    Delay_ms(1);   //LCD等待寫入完成
    EN=0;          //禁能LCD    
}
/***************************************************************
*函數名稱: LCD_Cmd
*功能描述: 傳送命令到文字型LCD
*輸入參數：Cmd
************************************************************/
void LCD_Cmd(unsigned char Cmd) //傳送命令到LCD
{
    Data=Cmd;  //命令送到BUS
    RS=0;EN=1; //命令寫入到LCD內
    Delay_ms(1);    //LCD等待寫入完成     
    EN=0;           //禁能LCD
}
/***************************************************************
*函數名稱: LCD_init
*功能描述: 啟始化文字型LCD
*****************************************************************/
void LCD_init(void)    //LCD的啟始程式  
{
    LCD_Cmd(0x38);/*0011 1000,8bit傳輸,顯示2行,5*7字型
                    bit4:DL=1,8bit傳輸,
                    bit3:N=1,顯示2行
                    bit2:F=0,5*7字型*/    
    LCD_Cmd(0x0c);/*0000 1100,顯示幕ON,不顯示游標,游標不閃爍
                    bit2:D=1,顯示幕ON
                    bit1:C=0,不顯示游標
	                bit0:B=0,游標不閃爍*/
    LCD_Cmd(0x06);/*0000 0110,//顯示完游標右移,游標移位禁能 
                    bit1:I/D=1,顯示完游標右移,
                    bit0:S=0,游標移位禁能*/  
    LCD_Cmd(0x01); //清除顯示幕  
    LCD_Cmd(0x02); //游標回原位  
}
