/********** RYG2.c ******************************
*動作：令LED輸出紅黃綠燈的變化
************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
sfr  LED=0x80; //P0為LED輸出
char code Table[] =
{ 0x21,30,0x01,1,0x21,1,0x01,1,0x21,1,0x01,1,0x21,1,0x11,4,
  0x0C,30,0x08,1,0x0C,1,0x08,1,0x0C,1,0x08,1,0x0C,1,0x0A,4,
  0};//資料0為重新開始

main()
{
  char i;     //資料計數
  while(1)
   {
     i=0;     //資料計數=0
     while(1) //永久循環執行
      {
        if(Table[i]==0) break; //若資料=0，退出迴圈重新開始
        LED=~Table[i++];  //紅黃綠燈資料反相輸出,計數+1
        Delay_ms(Table[i++]*10);//時間送到延時函數,計數+1
       }
    }
}
