/********** 5_1.c *****************************
* 動作：主程式P0遞加，INT0腳輸入0準位或負緣觸發時，P0閃爍5次
**********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
main()    //主程式
{
  unsigned char i=0; //定義變數=0
  EA=1;      //致能整體中斷
  EX0=1;     //致能外部INT0中斷
  while(1)   //不斷循環
   {
     P0=i;   //變數由P0輸出
	 Delay_ms(50);
     i++;
   }
}
//********INT0中斷函數，使用暫存器庫1**********
void EX0_int(void) interrupt 0 using 1 
 {
    char i=0;     //定義閃爍計數變數
	unsigned int  dly;     //定義延時變數
    for(i=0;i<5;i++) //設定閃爍5次
     {
      P0=0x00; for(dly=0;dly<20000;dly++);//全亮，延時
      P0=0xff; for(dly=0;dly<20000;dly++);//全暗，延時
	 }
 }