/********** 7_1.c ****MODE0串列發射*********
* 動作：以MODE0串列格式，將陣列字元發射出去
********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
char code TABLE[]={"ABCDEFGHIJKLMNOP"};//陣列字元資料 

main()
{
   char  i;   //字元計數值
   SCON=0x00;  /*0000 0000,設定串列埠為模式0
                 bit7-6:mode=00,串列埠為模式0 */ 
   for(i=0;i<16;i++)  //字元計數值=0~15
    {
     SBUF=TABLE[i]; //陣列內1個字元送到SBUF，開始發射
     while(TI==0);  //若TI=0表示未發射完畢，再繼續檢查
     TI=0;          //若TI=1表示已發射完畢，須清除TI=0     
    }
   while(1);        //自我空轉
}