/********** UART3.c **********MODE3串列發射**************
*動作：陣列字元由TXD腳以MODE3的UART格式傳輸至個人電腦
*********************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
char code TABLE[]={"ABCDEFGHIJKLMNOP"};//陣列字元資料
/*****************************************************
*函數名稱: UART
*功能描述: UART MODE3啟始程式
*輸入參數：bps
*****************************************************/
void UART(unsigned int bps)  //串列環境及鮑率設定
{
   SCON = 0xc8;          //設定串列傳輸為mode3及TB8=1
   TMOD = 0x20;          //設定Timer1為mode2
   TH1 = 256-(28800/bps);//設計時器決定串列傳輸鮑率
   TR1 = 1;              //開始計時
}
//*****************************************************
void main(void)
{
  char i ;           //字元計數值
  UART(9600);   //設定串列環境及鮑率
  for(i=0;i<16;i++)  //字元計數值=0~16
  {
    SBUF = TABLE[i]; //陣列字元送到SBUF，開始發射
    while(TI==0);    //若TI=0表示未發射完畢，再繼續檢查
    TI = 0;          //若TI=1表示已發射完畢，令TI=0     
  }
   while(1);          //自我空轉
}