/********** UART1.c *****MODE1串列發射****************
*動作：陣列字元由TXD腳以UART格式傳輸至個人電腦
*****************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
char code TABLE[]={"歡迎參觀\n"};//陣列字元中文資料及跳行
//char code TABLE[]={"HELLO!!"}; //陣列字元資料

main()
{
  char *s ;		 //宣告指標變數
  UART_init(9600); //UART啟始程式，設定串列環境及鮑率
  while(1)
   {
	 for(s=TABLE;*s != '\0' ;)//陣列字元計數值
	  {
	   SBUF=*s++ ;	//陣列字元送到SBUF，開始發射
	   while(TI==0); //若TI=0表示未發射完畢，再繼續檢查
	   TI=0 ;	  //若TI=1表示已發射完畢，令TI=0  
	  }
	 Delay_ms(100);     //延時
   }
}
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{
   SCON = 0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD = 0x20;     //設定TIMER1為MODE2
   TH1=TL1=256-(28800/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;          //開始計時
}