/********** 5_4.c ******************************
* 動作：P0遞加超過6會進入省電模式，停止執行，在
*    INT0(P32)腳輸入負緣觸發時，會喚醒閃爍5次後，才回主程式
************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
main()    //主程式
{
  char i=0; //定義變數=0
  EA=1;      //致能整體中斷
  EX0=1;     //致能外部INT0斷
  IT0=1;     //設定INT0腳為負緣觸發輸入   
  while(1)   //不斷循環
   {
      for(i=0;i<6;i++)  //計數0~5
       {
          P0=i;   //變數由P0輸出
	      Delay_ms(1000);
       }
      //PCON=IDL;  //進入IDEL省電模式，等待外部中斷
     PCON=PD;  //進入Power Down省電模式，等待重置
   }
}
//*******INT1中斷函數0，使用暫存器庫1*******
void EX1_int(void) interrupt 0 using 1  
{
  char i=0;        //定義閃爍計數變數
  unsigned int dly;
  for(i=0;i<5;i++) //閃爍計數0~4
   {
     P0=0x00; for(dly=0;dly<20000;dly++); 
     P0=0xff; for(dly=0;dly<20000;dly++); 
   }
}
