/************* 3_30.c ****************
*動作：P1輸入1~3，P0=輸出字元A~C
************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
main()
{
  char a,i;    //宣告變數
 loop:
   a=P1;        //P1輸入到變數a
   switch(a)    //判斷變數a的數字
    {
      case 1:   //若數字=1，
        i='A';  //變數i=字元A
    	break;  //退出迴圈
      case 2:   //若數字=2
        i='B';  //變數i=字元B
		break;  //退出迴圈  
      case 3:   //若數字=3，
        i='C';  //變數i=字元C
		break;  //退出迴圈  
      default:  //其它數字，變數i=字元D
        i='D';
    }
  P0=i;          //變數i由P0輸出
  goto loop;
}