/********** UART9.C ********串列埠函數接收*****************
* 動作：電腦UART送出字元，由getchar()函數接收，在P0顯示
*                         由getkey()函數接收，在P2顯示
***********************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
#include <stdio.h>   //加入基本輸出入函數
main()
{
  UART_init(9600); //設定串列環境及鮑率
  TI=1;
  while(1)    //不斷循環執行
   { 
    P0=getchar(); //等待按鍵，由串列埠輸入一個字元到P0顯示
    printf(“\n”);       //跳行
    P2=getkey();  //等待按鍵，由串列埠輸入一個字元到P2顯示
    printf(“\n”);       //跳行
  }
}
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{
   SCON = 0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD = 0x20;     //設定TIMER1為MODE2
   TH1 = 256-(28800/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;          //開始計時
}