/********** UART5.c ********MODE1串列中斷接收****************
*動作：電腦UART送出字元，由RXD腳以中斷接收，在P0顯示
***********************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
main()
{
  UART_init(9600); //設定串列環境及鮑率
  EA=1;ES=1;  //致能串列中斷
  while(1);   //自我空轉，表示可做其它工作
}

void SCON_int (void)  interrupt 4  //串列中斷函數 
 {
   RI=0;     //接收完畢，令RI=0
   P0=SBUF;  //將接收到的字元由P0輸出
 }
/***********************************************************
*函數名稱: UART_init
*功能描述: UART啟始程式
*輸入參數：bps
************************************************************/
void UART_init(unsigned int bps)  //UART啟始程式
{
   SCON=0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD=0x20;     //設定TIMER1為MODE2
   TH1=256-(28800/bps);  //設計時器決定串列傳輸鮑率
   TR1=1;          //開始計時
}