/********** UART4.c *****MODE3串列接收***************
* 動作：電腦UART送出字元，由RXD腳接收，在P1顯示
******************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
/***********************************************************
*函數名稱: UART
*功能描述: UART MODE3啟始程式
*輸入參數：bps
************************************************************/
void UART(unsigned int bps)  //串列環境及鮑率設定
{
   SCON = 0xd0;   //設定串列傳輸為MODE3及致能接收
   TMOD = 0x20;   //設定TIMER1為MODE2
   TH1 = 256-(28800/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;      //開始計時
}
//**************************************************
void main(void)
{
   UART_init(9600);     //設定串列環境及鮑率
   while(1)        //重覆執行
   {
    while(RI==0); //若RI=0表示未接收完畢，再繼續檢查
    RI=0;         //若RI=1表示已接收完畢，令RI=0
    P1=SBUF;      //將接收到的字元由P1輸出
   }
}

void UART_init(unsigned int bps)  //UART啟始程式
{
   SCON = 0x50;     //設定UART串列傳輸為MODE1及致能接收
   TMOD = 0x20;     //設定TIMER1為MODE2
   TH1 = 256-(28800/bps);  //設計時器決定串列傳輸鮑率
   TR1 = 1;          //開始計時
}


