/*********** STEP1.C ****************************
*動作：將驅動數碼存在陣列資料，由STEP輸出驅動步進馬達運轉
*接線：步進馬達輸出：P34=A,P35=B,P36=/A,P37=/B 
***********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
sfr   LED=0x80;  //LED由P0輸出
sfr   STEP=0xB0; //步進馬達由P3輸出
unsigned char run_Table[]={0x1,0x2,0x4,0x8};//驅動數碼
void main()
{
  char i;     //定義資料計數
  STEP=0x0F;   //步進馬達初值：P34~P37=0000
  while(1) 
   {
     for(i=0;i<=3;i++)   //資料計數由0-->3,步進馬達正轉
     //for(i=3;i>=0;i--) //資料計數由3-->0,步進馬達反轉
     {
       LED=run_Table[i];     //讀取驅動數碼由LED輸出 
	   STEP=run_Table[i]<<4; //讀取驅動數碼由步進馬達輸出
       Delay_ms(2);  //延時時間  
     } 
  } 
}