/********** 6_1.c ****************************
*動作：P0.0輸出方波，設定Timer0、mode0進行延時動作
**********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
void Delay(void); //宣告自定函數
main()
{
  TMOD=0x00;  /*0000 0000 設定Timer0為mode0內部計時 
                bit3:GATE=0,不使用INT0腳控制
			    bit2:C/T=0,內部計時
			    bit1-0:MODE=00，模式0 */
  TR0=1;        //啟動Timer0
  while (1)     //不斷循環執行
   {  
      P0_0=!P0_0; //P0.0反相
      Delay();    //延時函數
   }
}
/********************************************/
void Delay(void)  //5000uS延時函數
{
  TL0= (8192-5000) % 32; //將低5-bit計數值存入TL0 
  TH0= (8192-5000) / 32; //將高8-bit計數值存入TH0
  while(TF0==0);  //等待計時溢位，若TF0=0自我循環
  TF0=0;  //若計時溢位TF0=1，清除TF0=0 
}