/********** 6_5.c *****************************
*動作：主程式P0遞加，設定Timer1及mode2進行延時動作
**********************************************/
#include “..\AT89X52.H”
 void Delay(unsigned char i); //宣告自定函數

main()
{
 TMOD=0x20;  /*0010 0000,設定Timer1為mode2內部計時
	bit7:GATE=0,不使用INT1腳啟動計時
	bit6:C/T=0,內部計時
	bit5-4:MODE=10，mode2 */
 TL1=TH1=256-100;  //將8位元計數值存入TL1及TH1
 TR1=1;         //啟動Timer1 
 while (1)      //不斷循環執行
   {
     P0++;      //P0遞加輸出
     Delay(4);  //延時函數，重覆4次計時
   }
}
/**********************************************/
void Delay(unsigned char i)    //延時函數
{
   while(i--)     //重覆計時次數 
    {
      while(TF1==0); //等待計時溢位，若TF1=0自我循環
      TF1=0; //若計時溢位TF1=1，TH1自動載入TL1，清除TF1=0
    }
}
