/********** 6_8.c *****************************
*動作：外部接腳T2(P10)每輸入10個脈波令P0遞加，
*      Timer2溢位重新載入
************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
void Delay(void);      //宣告自定函數
main()
{
  T2CON=0x02;/* 0000 0010，設定為外部計數，溢位重新載入
                bit3:EXEN2=0,不使用外部T2EX接腳
			    bit1:C/T2=1,外部計數 */
  RCAP2=T2R=(65536-10);  //設定Timer2及重新載入時間
  TR2=1;     //啟動Timer2開始計時
  while (1)  //不斷循環執行
    {
       P0++;    //P0遞加輸出
       Delay(); //延時函數
    }
}
/*****************************************************/
void Delay(void)   //延時函數
{
  while(TF2==0);//等待外部計數10次，若TF2=0表示未溢位自我循環
  TF2=0; //若計時溢位TF2=1，RCAP2自動重新載入T2，清除TF2=0
}