/********** fre1.c ***************************
*動作：設定以Timer0計時中斷，令喇叭輸出指定的頻率
**********************************************/
#include "..\AT89X52.H"  //暫存器及組態定義
sbit   SPEAK=0xA6;       //P26喇叭輸出
#define  F 1000          //定義輸出頻率=1KHz
#define  T 11059200/12   //T=Fosc/12=基本的計時頻率 
#define  t 65536-(T/F/2) //t=半週期頻率的計時器內容
main()
{
 EA=1;ET0=1;        //致能Timer0計時中斷
 TMOD=0x01;         //設定Timer0為mode1
 TL0=t; TH0=t >> 8; //設定時間  
 TR0=1;             //啟動Timer0開始計時 
 while(1);          //空轉，等待計時溢位
}
/*******************************************************/ 
void T0_int(void) interrupt 1  //Timer0中斷函數
{
  TL0=t; TH0=t >> 8;    //重新設定時間  
  SPEAK = !SPEAK;       //啦喇反相輸出
}