/********** fre2.c ************************************
*動作：設定Timer0及Timer1的mode1計時中斷，令P16及P17
*      輸出指定的頻率
********************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
#define  F0  1000          //定義F0輸出頻率=1KHz
#define  F1  4000          //定義F1輸出頻率=4KHz
#define  T   11059200/12   //T=Fosc/12 
#define  t0  65536-T/F0/2  //F0的半週期時間計時器內容
#define  t1  65536-T/F1/2  //F1的半週期時間計時器內容
main()
{
 TMOD = 0x11;      //設定Timer0及Timer1為mode1
 EA=1;ET0=1; ET1=1;//致能Timer0及Timer1計時中斷
 PT1=1;            //設定較高頻的Timer1計時中斷優先
 TR0=1; TR1=1;     //啟動Timer0-1開始計時
 while(1);         //空轉，等待計時溢位
}
/**************************************************/
void T0_int(void) interrupt 1   //Timer0中斷函數
{
  TL0= t0; TH0=t0 >> 8; //重新設定Timer0時間
  P1_6 = !P1_6;     //P16反相輸出
}
/***************************************************/
void T1_int(void) interrupt 3    //Timer1中斷函數
{
  TL1= t1; TH1= t1 >> 8; //重新設定Timer1時間  
  P1_7 = !P1_7;     //P17反相輸出
}