//******** 3_1A.c *******自定變數的資料型態********
//*動作：重新定義變數的型態
//*************************************************
#include "..\AT89X52.H" //組態設定
void main()
{
   uint8  i=250;        //宣告8-bit無符號變數，範圍0~255
   int8   j=-120;       //宣告8-bit有符號變數，範圍0-128~127
   uint16 k=65530;      //宣告16-bit無符號變數，範圍0~65535
   uint32 l=0x12345678; //宣告32-bit無符號變數，範圍0x00000000~0xffffffff
   fp32   m=1.02;       //宣告32-bit浮點數
 loop:
    i=i+1;    //8-bit無符號變數+1;
    j=j+1;    //8-bit有符號變數+1
    k=k+1;    //16-bit無符號變數+1
	l=l+1;    //32-bit無符號變數+1
    m=m+0.01; //32-bit浮點數+0.01
  goto loop;  //跳到loop處 
}
