/************* 3_42.c ********************************
*動作：令LED來回輸出霹靂燈，不斷的循環
***********************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
sfr    LED=0x80; //P0為LED輸出
main()
{
 unsigned char  j=0x01;  //輸出值 
  char  i;       //計數
  for(  ;  ; )   //不斷的循環執行 
  {
    for (i=1;i<8;i++)  //左移7次 
     {
       LED=j;    //變數j由LED輸出
       Delay_ms(100);  //延時
       j=j<<1;  //變數j左移1 bit
     }
    for (i=1;i<8;i++)  //右移7次
     {
       LED=j;    //變數j由LED輸出
       Delay_ms(100);  //延時
       j=j>>1;  //變數j右移1 bit
     }
  }
}