/********** 6_11.c ***************************
*動作：設定以Timer0計時中斷mode1、定時令P0遞加
**********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
main()
  {
   TMOD = 0x01; /*0000 0001，設定Timer0為mode1內部計時
                  bit3:GATE=0,不使用外部INT0接腳
			      bit2:C/T0=0,內部計時 
			      bit1-0:MODE=01,使用模式1工作*/
   TL0=65536-10; TH0=(65536-10)>>8; //設定Timer0計數值
   P0=0;          //P0輸出0
   EA=1;ET0=1;    //致能Timer0中斷
   TR0=1;         //啟動Timer0開始計時
   while(1);      //自我空轉，表示此時可作其它事情
  }
/************************************************************/
void T0_int(void) interrupt 1  //Timer0中斷函數
  {
    TL0=65536-10; TH0=(65536-10)>>8; //重新設定Timer0計數值
    P0++;    //P0遞加輸出
  }