/********** 6_6.c ******************************
*動作：主程式P0遞加，設定以Timer0、mode3進行延時動作
************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
 void Delay0(void); //宣告TL0延時函數
 void Delay1(void); //宣告TH0延時函數
main()
{
  TMOD = 0x03;    /*0000 0011，設定Timer0為mode3內部計時
                    bit3:GATE=0,不使用INT1腳啟動計時
			        bit2:C/T=0,內部計時
			        bit1-0:MODE=11，mode3 */
  while (1)       //不斷循環執行
   {
    P0++;         //P0遞加輸出
    Delay0();     //TL0延時函數
    Delay1();     //TH0延時函數
    }
}
/***************************************/
void Delay0(void)  //TL0延時函數
{
  TL0=256-10;    //將8位元計數值存入TL0
  TR0=1;            //啟動TL計時
  while(TF0==0);   //等待計時溢位，若TF0=0自我循環
  TR0=0;            //停止TL0計時
  TF0=0;            //若計時溢位TF0=1，清除TF0=0    
}
/***************************************/
void Delay1(void)  //TH0延時函數
{
  TH0=256-10;    //將8位元計數值存入TH0
  TR1=1;         //啟動TH0計時
  while(TF1==0); //等待計時溢位，若TF1=0自我循環
  TF1=0;          //若計時溢位TF1=1，清除TF1=0
  TR1=0;          //停止TH0計時
}