/********** 4_4.C ****************************
*動作：由KEY按鍵開關輸入，LED遞加輸出計數值
***********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義 
sfr    LED=0x80; //P0為LED輸出
sbit   KEY=P3^2; //按鍵開關由P32輸入
main() 
{
   LED=0;   //LED輸出 
   while(1) //重覆執行 
   {
    do
	  {
		while(KEY==1);//若未按鍵，KEY=1空轉
	//	Delay_ms(20);   //若有按鍵，延時避開機械跳動
	  }
	 while(KEY == 1);//延時後，KEY仍為1，跳到do重新檢查
	    
	 LED++;   //LED遞加
	 do
	  {
		while(KEY==0);//若未放鍵，KEY=0空轉
	//	Delay_ms(20);  //若有放鍵，延時避開機械跳動
	  }
	 while(KEY== 0); //延時後，KEY仍為0，跳到do重新檢查
   }
} 