/*******************SEG1.C***********************
*動作：低電位送出數碼資料到a~g，令共陽極七段顯示器顯示0~F
*接線：Data0=a , Data1=b ,....Data6=g , Data7=P	
************************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
sfr  Data=0x80;//P0資料BUS輸出
 unsigned char code Table[] //七段顯示器0~F數碼資料
  ={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
    0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71}; 
void main() 
{
  char i;  //資料計數
  P1=0xf0; //P10~3=0000,令硬體實習板上七段顯示器的共陽極有高電位
  while(1) //重覆執行
   {
    for(i=0;i<16;i++) //計數=0~15
     {
       Data=~Table[i];//讀取顯示器數碼資料低電位輸出
       Delay_ms(50);  //延時  
     }
   }
}