/********** 6_2.c ****************************
*動作：P0.0輸出方波，設定Timer1、mode1進行延時動作
**********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
void Delay(char dly);  //宣告延時函數
#define T  10000 //延時10000uS
//#define T  10000*110592/120000 //頻率由12MHz改為11.0592MHz
main()         
{
  TMOD=0x10;  /*0001 0000,設定Timer1為mode1內部計時
               bit7:GATE=0,不使用INT1腳控制
			   bit6:C/T=0,內部計時
			   bit5-4:MODE=01，mode1 */
  TR1=1;        //啟動Timer1
  while (1)     //不斷循環執行
   {
     P0_0=!P0_0; //P00反相
     Delay(10);  //延時10*10000uS=0.1秒
   }
}
/********************************************/
void Delay(char dly)  //延時函數
{
  while(dly--)	 //10000uS*dly次
  {
    TL1= (65536-T) % 256; //將低8-bit計數值存入TL1 
    TH1= (65536-T) / 256; //將高8-bit計數值存入TH1
    while(TF1==0);        //等待溢位，若TF1=0自我循環
    TF1=0;                //若計時溢位TF1=1，清除TF1=0   
  }
}