/********** 6_3.c *****************************
*動作：主程式P0遞加，設定以Timer1、mode1、由INT1腳啟
*      動計時的延時動作
***********************************************/
#include "..\AT89X52.H"   //暫存器及組態定義
void Delay(void); //宣告自定函數
main()
{
   TMOD = 0x90; /*1001 0000,設定Timer1的GATE=1及mode1
                  bit7:GATE=1,使用INT1腳啟動計時
			      bit6:C/T=0,內部計時
			      bit5-4:MODE=01，mode1 */				 
   TR1=1;       //啟動Timer1
   while (1)    //不斷循環執行
   {
    P0++;       //P0遞加輸出
    Delay();    //延時函數
   }
}
/********************************************/
void Delay(void)  //延時函數
{
  TL1=65536-50000;      //將低8位元計數值存入TL1 
  TH1=(65536-50000)>>8; //將高8位元計數值存入TH1
  while(TF1==0);        //等待計時溢位，若TF1=0自我循環
  TF1=0;   //若計時溢位TF1=1，清除TF1=0
}