/************** 3_34.c **********************************
*動作：令LED來回輸出霹靂燈，不斷的循環
*****************************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
sfr    LED=0x80; //P0為LED輸出
main()
{
 int i=0x01;
 while (1)   //不斷的循環
  {
    while (i<=0x80)   //繼續左移到bit7=1
     {
       LED=i; Delay_ms(100);  
       i=i<<1 ;    //左移1-bit
     }
    i=0x80;   //i恢復為0x80
    while (i>=0x01)   //繼續右移到bit0=1
     {
       LED=i; Delay_ms(100);   
       i=i>>1 ;   //右移1-bit
     }
    i=0x01;   //重新設定i=0x01
  }
}