/************* 3_47.c ***********************
*動作：用for指令，由P0-P2輸出24小時電子鐘的變化
***********************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
main()
{
 char hor,min,sec;//宣告時、分、秒變數  
 for ( ; ; )    //重覆執行
   {
     for (hor=0;hor<=23;hor++)  //時0~23
      {
       for (min=0;min<=59;min++)   //分0~59
        { 
          for (sec=0;sec<=59;sec++)  //秒0~59
           {
            P0=(sec/10<<4)+(sec%10); //秒十進位輸出
			P1=(min/10<<4)+(min%10); //分十進位輸出
			P2=(hor/10<<4)+(hor%10); //時十進位輸出
            Delay_ms(100); //延時
           }
        }
     }
  }
}