//*********** 3_1.c ****變數的資料型態********************
//*動作：變數的宣告及應用
//********************************************************
void main()
{
   unsigned char i=250;        //宣告8-bit無符號變數，範圍0~255
   char          j=-120;       //宣告8-bit有符號變數，範圍0-128~127
   unsigned int  k=65530;      //宣告16-bit無符號變數，範圍0~65535
   unsigned long l=0x12345678; //宣告32-bit無符號變數，範圍0x00000000~0xffffffff
   float         m=1.02;       //宣告32-bit浮點數
 loop:
   i=i+1;    //8-bit無符號變數+1
   j=j+1;    //8-bit有符號變數+1
   k=k+1;    //16-bit無符號變數+1
   l=l+1;    //32-bit無符號變數+1
   m=m+0.01; //32-bit浮點數+0.01
  goto loop;  //跳到loop處 
}