/************** 3_25A.c **************************
*動作：用if和goto指令，由P0-P2輸出24小時電子鐘的變化
***********************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
main()
{       
   char hor=23,min=58,sec=52; //設定時、分、秒時間
 loop:
    P0=(sec/10<<4)+(sec%10); //秒十進位輸出
	P1=(min/10<<4)+(min%10); //分十進位輸出
	P2=(hor/10<<4)+(hor%10); //時十進位輸出
    Delay_ms(100);  //延時
    sec++;                       // 秒加一
   if (sec < 60) goto loop;    // 若秒小於60到loop處   
   sec=0; min++;               // 秒等於60則令秒=0，分加一
   if (min < 60) goto loop;    // 若分小於60到loop處   
   min=0; hor++;               // 若分等於60則令分=0，時加一
   if (hor <24) goto loop;     // 若時小於24到loop處
   hor=0;min=0; sec=0; goto loop;// 若時等於24則令時、分、秒=0 
}
