/************** 3_31.c *******************************
*動作：P1輸入(限1~3)設定動作，令P0輸出不同的功能
****************************************************/
#include "..\AT89X52.H"  //暫存器及組態設定	
main()
{
   char a,i=1;  //宣告變數
 loop:
   a=P1;       //P1輸入到變數a
   switch (a)
    {
       case 1:    //數字=1
         i++;     //i=i+1
         break;   //退出迴圈
       case 2:    //數字=2
         i=i*2;    //i=i*2
         break;   //退出迴圈
       case 3:    //數字=3
         i--;     //i=i-1
         break;   //退出迴圈
	   default:   //其它數字，i=i/2
         i=i/2;	//i=i/2
     }
   P0=i;  //變數i由P0輸出
 goto loop;
}