/************* 3_43.c*************************
*動作：令LED來回輸出7次
**********************************************/
#include "..\AT89X52.H"  //暫存器及組態設定
sfr    LED=0x80; //P0為LED輸出	
main()
{
  unsigned char  j;   //輸出值
  char  i;            //計數
  for(i=1;i<=7;i++)   //LED來回輸出7次
   {
     for(j=0x01;j<0x80;j=j<<1) //左移到bit7=1
      {
        LED=j;         //變數j由LED輸出
		Delay_ms(100); //延時
      }
     for(j=0x80;j>0x01;j=j>>1)//右移到bit0=1
      {
        LED=j;         //變數j由LED輸出
		Delay_ms(100); //延時
      }
     }
  for(  ;  ; );    //自我空轉
}